In [2]:
import pandas as pd
from pymongo import MongoClient

In [3]:
dummy_data = [
    {
        "name":"Basit",
        "Role": "Student"
    },
    {
        "name": "Shakil",
        "Role": "Private_Service"
    },
    {
        "name": "Rohima",
        "Role": "Student
    ]

dummy_df = pd.DataFrame(dummy_data)

In [4]:
dummy_df

     name             Role
0   Basit          Student
1  Shakil  Private_Service

## New Column Addition Direct method

In [5]:
dummy_df['gender'] = "Male"

In [8]:
female_data = [{
    "name": "Rohima",
    "Role": "Student",
    "gender": "Female"}]
female_df = pd.DataFrame(female_data)

In [30]:
female_df

     name     Role  gender
0  Rohima  Student  Female

In [6]:
dummy_df

     name             Role gender
0   Basit          Student   Male
1  Shakil  Private_Service   Male

## Using filter pandas

In [9]:
dummy_df = pd.concat([dummy_df, female_df])

In [10]:
dummy_df

     name             Role  gender
0   Basit          Student    Male
1  Shakil  Private_Service    Male
0  Rohima          Student  Female

In [15]:
cond = dummy_df.Role=="Student" # condition or filter

In [16]:
dummy_df[cond]

     name     Role  gender
0   Basit  Student    Male
0  Rohima  Student  Female

## Apply function pandas ( basic + Lamda )

In [17]:
def func(x):
    something

dummy_df['Month_Expense'] = dummy_df.Role.apply(lambda x: 5000 if x == "Student" else 30000)

In [18]:
dummy_df

     name             Role  gender  Month_Expense
0   Basit          Student    Male           5000
1  Shakil  Private_Service    Male          30000
0  Rohima          Student  Female           5000

In [19]:
dummy_df['dress'] = dummy_df.Role.apply(lambda x: 2 if x == "Student" else 5)

In [20]:
dummy_df

     name             Role  gender  Month_Expense  dress
0   Basit          Student    Male           5000      2
1  Shakil  Private_Service    Male          30000      5
0  Rohima          Student  Female           5000      2

In [21]:
dummy_df['dress_expense'] = dummy_df['dress']*1500

In [22]:
dummy_df

     name             Role  gender  Month_Expense  dress  dress_expense
0   Basit          Student    Male           5000      2           3000
1  Shakil  Private_Service    Male          30000      5           7500
0  Rohima          Student  Female           5000      2           3000

In [23]:
"hello" + "World"

'helloWorld'

In [24]:
dummy_df['name'] = dummy_df['name']+'_'+dummy_df['gender']

In [25]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0     Basit_Male          Student    Male           5000      2           3000
1    Shakil_Male  Private_Service    Male          30000      5           7500
0  Rohima_Female          Student  Female           5000      2           3000

In [27]:
name = "Basit_Male_somet"

name.split("_")

['Basit', 'Male', 'somet']

In [28]:
cond = dummy_df.gender=="Male"
dummy_df['name'] = dummy_df[cond].name.apply(lambda x: x.split("_")[0])

In [29]:
dummy_df

     name             Role  gender  Month_Expense  dress  dress_expense
0   Basit          Student    Male           5000      2           3000
1  Shakil  Private_Service    Male          30000      5           7500
0   Basit          Student  Female           5000      2           3000

In [31]:
dummy_df.reset_index(drop=True, inplace=True)

In [32]:
dummy_df

     name             Role  gender  Month_Expense  dress  dress_expense
0   Basit          Student    Male           5000      2           3000
1  Shakil  Private_Service    Male          30000      5           7500
2   Basit          Student  Female           5000      2           3000

## New value addition in the column using "loc"filter

In [33]:
dummy_df.loc[dummy_df.gender=="Female", "name"] = "Rohima_Female"

In [34]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000      2           3000
1         Shakil  Private_Service    Male          30000      5           7500
2  Rohima_Female          Student  Female           5000      2           3000

In [35]:
dummy_df.loc[dummy_df.Role=="Student", "dress"] = 3

In [36]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000      3           3000
1         Shakil  Private_Service    Male          30000      5           7500
2  Rohima_Female          Student  Female           5000      3           3000

## Null value handling

In [38]:
dummy_df.loc[dummy_df.name=="Basit", "dress"] = None

In [39]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000    NaN           3000
1         Shakil  Private_Service    Male          30000    5.0           7500
2  Rohima_Female          Student  Female           5000    3.0           3000

In [42]:
dummy_df.dropna(subset="dress")

            name             Role  gender  Month_Expense  dress  dress_expense
1         Shakil  Private_Service    Male          30000    5.0         7500.0
2  Rohima_Female          Student  Female           5000    3.0         4500.0

In [44]:
dummy_df.dress = dummy_df.dress.fillna(0)

In [45]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000    0.0            NaN
1         Shakil  Private_Service    Male          30000    5.0         7500.0
2  Rohima_Female          Student  Female           5000    3.0         4500.0

In [46]:
dummy_df['dress_expense'] = dummy_df['dress']*1500

In [47]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000    0.0            0.0
1         Shakil  Private_Service    Male          30000    5.0         7500.0
2  Rohima_Female          Student  Female           5000    3.0         4500.0

In [48]:
dummy_df = pd.concat([dummy_df, dummy_df])

In [50]:
dummy_df.reset_index(drop=True, inplace=True)

In [51]:
dummy_df.drop_duplicates(inplace=True)

In [52]:
dummy_df

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000    0.0            0.0
1         Shakil  Private_Service    Male          30000    5.0         7500.0
2  Rohima_Female          Student  Female           5000    3.0         4500.0

In [53]:
dummy_df.sort_values("Month_Expense")

            name             Role  gender  Month_Expense  dress  dress_expense
0          Basit          Student    Male           5000    0.0            0.0
2  Rohima_Female          Student  Female           5000    3.0         4500.0
1         Shakil  Private_Service    Male          30000    5.0         7500.0

In [54]:
dress = [
    {
        "gender": "Male",
        "dress_1": "Pant",
        "dress_2": "Shirt",
        "dress_3": "Lungi"
    },
    {
        "gender": "Female",
        "dress_1": "Shirt",
        "dress_2": "pant",
    }
]

dress_df = pd.DataFrame(dress)

In [55]:
dress_df

   gender dress_1 dress_2 dress_3
0    Male    Pant   Shirt   Lungi
1  Female   Shirt    pant     NaN

In [56]:
merged = dummy_df.merge(dress_df, on="gender", how="left")

In [57]:
merged

,name,Role,gender,Month_Expense,dress,dress_expense,dress_1,dress_2,dress_3
0,Basit,Student,Male,5000,0.0,0.0,Pant,Shirt,Lungi
1,Shakil,Private_Service,Male,30000,5.0,7500.0,Pant,Shirt,Lungi
2,Rohima_Female,Student,Female,5000,3.0,4500.0,Shirt,pant,NaN

In [58]:
grouped = merged.groupby("Role")

In [59]:
for index, group in grouped:
    display(group)

,name,Role,gender,Month_Expense,dress,dress_expense,dress_1,dress_2,dress_3
1,Shakil,Private_Service,Male,30000,5.0,7500.0,Pant,Shirt,Lungi

,name,Role,gender,Month_Expense,dress,dress_expense,dress_1,dress_2,dress_3
0,Basit,Student,Male,5000,0.0,0.0,Pant,Shirt,Lungi
2,Rohima_Female,Student,Female,5000,3.0,4500.0,Shirt,pant,NaN

In [60]:
merged.shape

(3, 9)

In [61]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           3 non-null      object
 1   Role           3 non-null      object
 2   gender         3 non-null      object
 3   Month_Expense  3 non-null      int64
 4   dress          3 non-null      float64
 5   dress_expense  3 non-null      float64
 6   dress_1        3 non-null      object
 7   dress_2        3 non-null      object
 8   dress_3        2 non-null      object
dtypes: float64(2), int64(1), object(6)
memory usage: 348.0+ bytes